{
    "es": {
        "skip": "Saltar a contenido",
        "name": "Agustín Brollo",
        "role": "Especialista en IT",
        "nav.about": "Sobre mí",
        "nav.experience": "Experiencia",
        "nav.projects": "Proyectos",
        "nav.skills": "Habilidades",
        "nav.contact": "Contacto",
        "about.title": "Sobre mí",
        "about.p1": "Soy un especialista en IT con sólida experiencia en infraestructura, soporte técnico, administración de redes y desarrollo de software, abarcando desde aplicaciones móviles hasta videojuegos, hardware y herramientas personalizadas. Me formé en entornos corporativos exigentes, como <strong>HCL Technologies</strong>, donde gestioné redes, configuraciones de switches y tareas de mantenimiento crítico en sistemas empresariales. Manejo avanzado de entornos Linux, metodologías ágiles y adopción rápida de nuevas tecnologías. Integro IA generativa y flujos de trabajo mediante agentes (por ejemplo, con herramientas tipo Cursor), así como integración hardware-software mediante microcontroladores y sistemas de automatización.",
        "about.p2": "Me desempeño también como desarrollador independiente, con foco en C/C++, automatización en Linux, React Native, Node.js, Python, y uso avanzado de librerías como SFML y OpenGL. Domino frameworks y stacks modernos (Express, Docker, Supabase, AWS, MariaDB, PostgreSQL, MongoDB), y aplico principios de arquitectura modular y escalable para mis proyectos. Experiencia en integración de ElasticSearch para búsquedas avanzadas, despliegue/ajuste de modelos LLM locales (como Llama y Mistral), así como control preciso de hardware: programación en Arduino, manipulación avanzada de motores NEMA, técnicas de microstepping y automatización robótica. Destaco por mi capacidad de resolución de problemas, aprendizaje veloz y mentalidad adaptativa.",
        "about.p3": "Actualmente desarrollo <strong>FinanzApp</strong>, una app móvil integral de gestión de gastos basada en OCR, backend en Node.js y despliegue en AWS, y continúo impulsando proyectos de videojuegos, hardware y plugins abiertos, todos publicados y en continua actualización en GitHub. Comprometido con la mejora constante, mejores prácticas de ingeniería, IA aplicada y contribución a comunidades tecnológicas.",
        "experience.title": "Experiencia en IT",
        "experience.corp.title": "Especialista IT – Entorno corporativo",
        "experience.corp.subtitle": "Administrador de redes y soporte técnico",
        "experience.corp.li1": "Configuración, diagnóstico y mantenimiento de switches de red y dispositivos Cisco (Access Points, switches Layer 2/3), incluyendo reseteos, upgrades de firmware, y manejo de enlaces de fibra óptica (SFP).",
        "experience.corp.li2": "Gestión de infraestructura IT en entornos corporativos con múltiples niveles de usuario; configuración de VPNs, control de seguridad en firewalls Palo Alto, segmentación por VLANs, políticas y compliance.",
        "experience.corp.li3": "Resolución de incidentes técnicos, soporte a usuarios VIP, administración de stock y compras, migración de bases de datos a CRM usando Python y SQL.",
        "experience.corp.li4": "Monitoreo de redes, backups, actualizaciones programadas, troubleshooting de WiFi (análisis de tráfico, Wireshark), gestión de conflictos y mantenimiento programado para asegurar la continuidad del servicio.",
        "experience.freelance.title": "Freelance y entornos mixtos",
        "experience.freelance.subtitle": "Soporte técnico, desarrollo y automatización",
        "experience.freelance.li1": "Soporte integral en sistemas Windows y Linux.",
        "experience.freelance.li2": "Armado y mantenimiento de estaciones de trabajo para edición y servidores locales.",
        "experience.freelance.li3": "Automatización de tareas con scripts en Bash y PowerShell.",
        "experience.freelance.li4": "Instalación y configuración de redes domésticas y comerciales.",
        "experience.freelance.li5": "Desarrollo de herramientas personalizadas en C/C++ para automatización y optimización.",
        "experience.freelance.li6": "Implementación de soluciones en la nube con AWS y despliegue de aplicaciones.",
        "experience.freelance.li7": "Desarrollo de videojuegos con motor propio, lógica de juego y animaciones 3D.",
        "experience.freelance.li8": "Creación de scripts multiplataforma para procesos de infraestructura.",
        "projects.title": "Proyectos",
        "projects.p1.title": "Servidor AWS Económico",
        "projects.p1.desc": "Configuración desde cero de un servidor Minecraft en AWS EC2, incluyendo puertos, backups automáticos y publicación en GitHub.",
        "projects.p2.title": "Game of Pong con IA",
        "projects.p2.desc": "Juego Pong en C++ con red neuronal simple para entrenar la IA del oponente. Implementación desde cero con SDL2.",
        "projects.p3.title": "FinanzApp – Gestión inteligente de gastos personales",
        "projects.p3.desc": "Desarrollo full stack de aplicación móvil multiplataforma en React Native (frontend), backend Node.js, API REST y contenedores Docker. Integraciones avanzadas de OCR (PaddleOCR) con Python, NLP e IA local para análisis automático de tickets y estructuración de datos de gastos. Persistencia en Supabase, despliegue y automatización en AWS (EC2, S3, CloudFormation), buenas prácticas de control de versiones (Git) y testing automatizado. Planeada integración futura de OpenAI API para features avanzados.",
        "skills.title": "Habilidades Técnicas",
        "skills.langs.title": "💻 Lenguajes de programación",
        "skills.langs.li1": "C, C++ — desarrollo en bajo nivel, lógica de sistemas, videojuegos y control hardware (Arduino)",
        "skills.langs.li2": "JavaScript — proyectos frontend y backend (React Native, Node.js, Express), animaciones con Three.js",
        "skills.langs.li3": "Python — scripting, OCR, procesamiento científico, automatización y manejo de datos (Pandas, NumPy)",
        "skills.systems.title": "🖥️ Sistemas y entornos",
        "skills.systems.li1": "Linux — uso diario, bash scripting, administración, despliegue y mantenimiento de servidores",
        "skills.systems.li2": "Windows Server — instalación, configuración y mantenimiento",
        "skills.systems.li3": "Git / GitHub — flujo de trabajo con ramas, releases, documentación",
        "skills.networks.title": "🌐 Infraestructura y redes",
        "skills.networks.li1": "Configuración de switches y redes LAN, administración, cableado y resolución de incidencias.",
        "skills.networks.li2": "Administración de infraestructura IT en entornos reales, gestión de protocolos, políticas de seguridad, VLAN y firewalls (Palo Alto, Forti).",
        "skills.networks.li3": "Diagnóstico, mantenimiento y soporte técnico integral",
        "skills.cloud.title": "☁️ Cloud y automatización",
        "skills.cloud.li1": "AWS — EC2, S3, IAM, CloudFormation, automatización de backups, despliegue usando Docker Compose",
        "skills.cloud.li2": "Automatización de backups y despliegue en servidores",
        "skills.cloud.li3": "Optimización de servidores por costo, disponibilidad y seguridad, uso de herramientas de monitoreo",
        "skills.ai.title": "🧠 Inteligencia Artificial y computación",
        "skills.ai.li1": "Implementación de redes neuronales desde cero (sin frameworks), integración de LLM (GPT-4, Llama, Mistral), búsqueda semántica y agentes autónomos para tareas empresariales.",
        "skills.ai.li2": "Agentes y automatización con frameworks tipo Cursor. Arquitectura e integración de modelos LLM locales en aplicaciones de backoffice y automatización, procesamiento semántico de datos e IA aplicada.",
        "skills.ai.li3": "ElasticSearch para búsquedas avanzadas, NLP y flujos automáticos. Integración y despliegue de modelos en servidores Linux dedicados.",
        "skills.tools.title": "🛠️ Herramientas y tecnologías",
        "skills.tools.li1": "React Native, Node.js, Express — desarrollo mobile y backend; SFML/OpenGL — juegos; Docker (Compose) — contenedores y orquestación",
        "skills.tools.li2": "Supabase, MongoDB, MariaDB, PostgreSQL — bases de datos, migración y consultas avanzadas; ElasticSearch — búsquedas inteligentes y escalables",
        "skills.tools.li3": "Visual Studio (Code), Nano (Linux), Trello — productividad y gestión",
        "skills.tools.li4": "Shell scripting — Bash, CMD, PowerShell",
        "skills.tools.li5": "PaddleOCR — extracción de texto desde imágenes (Python)",
        "skills.tools.li6": "Three.js — animaciones 3D en la web, control de sprites y GUI",
        "skills.tools.li7": "Despliegue y uso de modelos LLM locales (Llama, Mistral) y pipelines de agentes autónomos con IA generativa.",
        "skills.tools.li8": "Arduino y microcontroladores — control y automatización con motores NEMA, microstepping, integración hardware-software para robótica/mecatrónica.",
        "skills.tools.li9": "Nivel de idiomas: Español (nativo), Inglés avanzado (C1 - Cambridge FCE)",
        "contact.title": "Contacto",
        "contact.cv_es": "Descargar CV (ES)",
        "contact.cv_en": "Download CV (EN)",
        "ui.lang_label": "Idioma"
    },
    "en": {
        "skip": "Skip to content",
        "name": "Agustín Brollo",
        "role": "IT Specialist",
        "nav.about": "About",
        "nav.experience": "Experience",
        "nav.projects": "Projects",
        "nav.skills": "Skills",
        "nav.contact": "Contact",
        "about.title": "About",
        "about.p1": "I am an IT specialist with strong experience in infrastructure, technical support, network management, software and hardware development, from mobile applications to video games, automation and custom tools. Trained in demanding corporate settings like <strong>HCL Technologies</strong>. Deep Linux skills, agility with new tech and agile methodologies. I integrate generative AI, agent workflows (e.g. Cursor), and hardware-software automation via microcontrollers and robotics.",
        "about.p2": "As an independent developer I focus on C/C++, Linux automation, React Native, Node.js, Python, advanced library use (SFML/OpenGL), and custom hardware. Mastery in modern stacks (Express, Docker, Supabase, AWS, MariaDB, PostgreSQL, MongoDB), modular/scalable architecture. Experience integrating ElasticSearch for advanced search, deploying/tuning local LLMs (Llama, Mistral), and precise hardware control: Arduino coding, advanced NEMA motor handling, microstepping and robotics automation. Fast learner, adaptive problem solver.",
        "about.p3": "Currently building <strong>FinanzApp</strong>, a full-featured mobile expense manager (OCR, Node.js backend, AWS), and continuous video game, hardware and plugin projects, all on GitHub. Committed to constant improvement, engineering best practices, applied AI and tech community collaboration.",
        "experience.title": "IT Experience",
        "experience.corp.title": "IT Specialist – Corporate environment",
        "experience.corp.subtitle": "Network administration and technical support",
        "experience.corp.li1": "Configuration, diagnostics, and maintenance of network switches and Cisco devices (Access Points, Layer 2/3 switches), including firmware upgrades/resets and handling of fiber links (SFP).",
        "experience.corp.li2": "IT infrastructure management in corporate settings; VPN configuration, Palo Alto firewall security control, VLAN-based segmentation, policy compliance.",
        "experience.corp.li3": "Incident resolution, VIP user support, inventory management, procurement, database migration to CRM with Python and SQL.",
        "experience.corp.li4": "Network monitoring, backups, scheduled updates, WiFi troubleshooting (traffic analysis, Wireshark), conflict management, and planned maintenance for service continuity.",
        "experience.freelance.title": "Freelance and mixed environments",
        "experience.freelance.subtitle": "Technical support, development, and automation",
        "experience.freelance.li1": "End-to-end support for Windows and Linux systems.",
        "experience.freelance.li2": "Workstation assembly and maintenance for editing and local servers.",
        "experience.freelance.li3": "Task automation with Bash and PowerShell scripts.",
        "experience.freelance.li4": "Home and commercial network installation and configuration.",
        "experience.freelance.li5": "Custom tools in C/C++ for automation and optimization.",
        "experience.freelance.li6": "Cloud solutions with AWS and app deployments.",
        "experience.freelance.li7": "Game development with custom engine, gameplay logic, and 3D animations.",
        "experience.freelance.li8": "Cross-platform scripting for infrastructure processes.",
        "projects.title": "Projects",
        "projects.p1.title": "Cost-efficient AWS Server",
        "projects.p1.desc": "From-scratch setup of a Minecraft server on AWS EC2, including ports, automated backups, and GitHub publication.",
        "projects.p2.title": "Game of Pong with AI",
        "projects.p2.desc": "C++ Pong with a simple neural network to train the AI opponent. Built from scratch using SDL2.",
        "projects.p3.title": "FinanzApp – Smart personal expense management",
        "projects.p3.desc": "Full stack development of a cross-platform mobile application in React Native (frontend), Node.js backend, REST APIs and Docker containers. Advanced OCR integration (PaddleOCR with Python), NLP and local AI for ticket analysis and data structuring. Data persistence with Supabase, deployment and automation on AWS (EC2, S3, CloudFormation), best practices in version control (Git) and automated testing. Planned future integration with OpenAI APIs for advanced features.",
        "skills.title": "Technical Skills",
        "skills.langs.title": "💻 Programming languages",
        "skills.langs.li1": "C, C++ — low-level development, system logic, games and hardware control (Arduino)",
        "skills.langs.li2": "JavaScript — frontend and backend (React Native, Node.js, Express), Three.js animations",
        "skills.langs.li3": "Python — scripting, OCR, scientific processing, automation, data management (Pandas, NumPy)",
        "skills.systems.title": "🖥️ Systems and environments",
        "skills.systems.li1": "Linux — daily use, bash scripting, admin, deployment, server maintenance",
        "skills.systems.li2": "Windows Server — installation, configuration, maintenance",
        "skills.systems.li3": "Git / GitHub — branching workflow, releases, documentation",
        "skills.networks.title": "🌐 Infrastructure and networking",
        "skills.networks.li1": "Switch/LAN setup, management, cabling, troubleshooting.",
        "skills.networks.li2": "IT infrastructure management, protocols, security, VLANs, firewalls (Palo Alto, Forti).",
        "skills.networks.li3": "Diagnostics, maintenance, and comprehensive support",
        "skills.cloud.title": "☁️ Cloud and automation",
        "skills.cloud.li1": "AWS (EC2, S3, IAM, CloudFormation), backup automation, Docker Compose deployments",
        "skills.cloud.li2": "Automated backups and deployments",
        "skills.cloud.li3": "Server optimization for cost, availability, and monitoring",
        "skills.ai.title": "🧠 AI and computing",
        "skills.ai.li1": "Neural networks from scratch (no frameworks), LLM integration (GPT-4, Llama, Mistral), semantic search & autonomous agents for business.",
        "skills.ai.li2": "Agent/workflow automation (e.g. Cursor), local LLM architecture for backoffice and automation, semantic processing, applied AI.",
        "skills.ai.li3": "ElasticSearch for advanced search, NLP, intelligent automation. Integration/deployment of models on dedicated Linux servers.",
        "skills.tools.title": "🛠️ Tools and technologies",
        "skills.tools.li1": "React Native, Node.js, Express — mobile/backend; SFML/OpenGL — games; Docker (Compose) — containers/orchestration",
        "skills.tools.li2": "Supabase, MongoDB, MariaDB, PostgreSQL — databases, migrations, advanced queries; ElasticSearch — scalable intelligent search",
        "skills.tools.li3": "Visual Studio (Code), Nano (Linux), Trello — productivity, management",
        "skills.tools.li4": "Shell scripting — Bash, CMD, PowerShell",
        "skills.tools.li5": "PaddleOCR — text extraction from images (Python)",
        "skills.tools.li6": "Three.js — 3D web animations, sprite/GUI control",
        "skills.tools.li7": "Deployment & use of local LLMs (Llama, Mistral), autonomous agent pipelines with generative AI.",
        "skills.tools.li8": "Arduino & microcontrollers — automation and NEMA motor control, microstepping, hardware-software integration for robotics/mechatronics.",
        "skills.tools.li9": "Languages: Spanish (native), Advanced English (C1 - Cambridge FCE)",
        "contact.title": "Contact",
        "contact.cv_es": "Descargar CV (ES)",
        "contact.cv_en": "Download CV (EN)",
        "ui.lang_label": "Language"
    }
}